Ran Plan for project: `cyberutopia-prod` dir: `accounts/cyberutopia-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.

data.aws_iam_policy_document.step_functions_xray: Reading...
data.aws_iam_policy_document.crossaccount_s3_read_policy_doc: Reading...
data.aws_iam_policy_document.step_functions_xray: Read complete after 0s [id=1256208417]
data.aws_iam_policy_document.crossaccount_s3_read_policy_doc: Read complete after 0s [id=2177998627]
data.aws_iam_policy_document.crossaccount_s3_read_role_trust: Reading...
data.aws_iam_policy_document.crossaccount_s3_read_role_trust: Read complete after 0s [id=1156554535]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.dlq_policy_document will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "dlq_policy_document" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowLambdaServiceToSendMessage"

          + principals {
              + identifiers = [
                  + "lambda.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_cloudwatch_dashboard.lambdas_dashboard will be created
+ resource "aws_cloudwatch_dashboard" "lambdas_dashboard" {
      + dashboard_arn  = (known after apply)
      + dashboard_body = (known after apply)
      + dashboard_name = "LambdaDashboard"
      + id             = (known after apply)
    }

  # aws_cloudwatch_dashboard.step_functions_dashboard will be created
+ resource "aws_cloudwatch_dashboard" "step_functions_dashboard" {
      + dashboard_arn  = (known after apply)
      + dashboard_body = (known after apply)
      + dashboard_name = "StepFunctionsDashboard"
      + id             = (known after apply)
    }

  # aws_cloudwatch_event_rule.workflow_schedule will be created
+ resource "aws_cloudwatch_event_rule" "workflow_schedule" {
      + arn                 = (known after apply)
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "cyberutopia_workflow_schedule"
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(5 minutes)"
      + tags_all            = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "cyberutopia"
        }
    }

  # aws_cloudwatch_event_target.state_machine_target will be created
+ resource "aws_cloudwatch_event_target" "state_machine_target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + role_arn       = (known after apply)
      + rule           = "cyberutopia_workflow_schedule"
      + target_id      = "cyberutopia_StepFunctionStateMachine"
    }

  # aws_cloudwatch_log_group.automated_step_function_log_group will be created
+ resource "aws_cloudwatch_log_group" "automated_step_function_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/vendedlogs/states/automated_workfloww"
      + name_prefix       = (known after apply)
      + retention_in_days = 3
      + skip_destroy      = false
      + tags_all          = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "cyberutopia"
        }
    }

  # aws_cloudwatch_log_group.fetch_data_log_group will be created
+ resource "aws_cloudwatch_log_group" "fetch_data_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/fetch_data"
      + name_prefix       = (known after apply)
      + retention_in_days = 3
      + skip_destroy      = false
      + tags_all          = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "cyberutopia"
        }
    }

  # aws_cloudwatch_log_group.notify_post_log_group will be created
+ resource "aws_cloudwatch_log_group" "notify_post_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/notify_post"
      + name_prefix       = (known after apply)
      + retention_in_days = 3
      + skip_destroy      = false
      + tags_all          = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "cyberutopia"
        }
    }

  # aws_cloudwatch_log_group.sns_to_teams_log_group will be created
+ resource "aws_cloudwatch_log_group" "sns_to_teams_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/sns_to_teams"
      + name_prefix       = (known after apply)
      + retention_in_days = 3
      + skip_destroy      = false
      + tags_all          = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "cyberutopia"
        }
    }

  # aws_cloudwatch_metric_alarm.automated_workflow_aborts will be created
+ resource "aws_cloudwatch_metric_alarm" "automated_workflow_aborts" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alert if the automated Step Function is aborted within a 5-minute window."
      + alarm_name                            = "cyberutopia-automated-workflow-aborts"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ExecutionsAborted"
      + namespace                             = "AWS/States"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "cyberutopia"
        }
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.automated_workflow_failures will be created
+ resource "aws_cloudwatch_metric_alarm" "automated_workflow_failures" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alert if the automated Step Function fails within a 5-minute window."
      + alarm_name                            = "cyberutopia-automated-workflow-failures"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ExecutionsFailed"
      + namespace                             = "AWS/States"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "cyberutopia"
        }
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.automated_workflow_timeouts will be created
+ resource "aws_cloudwatch_metric_alarm" "automated_workflow_timeouts" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alert if the automated Step Function times out within a 5-minute window."
      + alarm_name                            = "cyberutopia-automated-workflow-timeouts"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ExecutionsTimedOut"
      + namespace                             = "AWS/States"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "cyberutopia"
        }
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.check_duplicate_duration_high will be created
+ resource "aws_cloudwatch_metric_alarm" "check_duplicate_duration_high" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alert if check_duplicate function average duration exceeds 3s in a 5-minute window."
      + alarm_name                            = "cyberutopia-check_duplicate-duration-high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "FunctionName" = "check_duplicate"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Duration"
      + namespace                             = "AWS/Lambda"
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "cyberutopia"
        }
      + threshold                             = 3000
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.check_duplicate_errors will be created
+ resource "aws_cloudwatch_metric_alarm" "check_duplicate_errors" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alert if check_duplicate function returns any errors in a 5-minute window."
      + alarm_name                            = "cyberutopia-check_duplicate-errors"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "FunctionName" = "check_duplicate"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Errors"
      + namespace                             = "AWS/Lambda"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "cyberutopia"
        }
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.check_duplicate_invocations_anomaly will be created
+ resource "aws_cloudwatch_metric_alarm" "check_duplicate_invocations_anomaly" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alert if check_duplicate invocations deviate from normal"
      + alarm_name                            = "cyberutopia-check-duplicate-invocations-anomaly"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanUpperThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "cyberutopia"
        }
      + threshold_metric_id                   = "e1"
      + treat_missing_data                    = "missing"

      + metric_query {
          + id          = "m1"
          + label       = "CheckDuplicateInvocationsWithAnomalyDetection"
          + return_data = true
            # (2 unchanged attributes hidden)

          + metric {
              + dimensions  = {
                  + "FunctionName" = "check_duplicate"
                }
              + metric_name = "Invocations"
              + namespace   = "AWS/Lambda"
              + period      = 300
              + stat        = "Sum"
                # (1 unchanged attribute hidden)
            }
        }
      + metric_query {
          + expression  = "ANOMALY_DETECTION_BAND(m1, 2)"
          + id          = "e1"
          + label       = "AnomalyDetectionBand"
          + return_data = true
            # (1 unchanged attribute hidden)
        }
    }

  # aws_cloudwatch_metric_alarm.check_duplicate_memory_high will be created
+ resource "aws_cloudwatch_metric_alarm" "check_duplicate_memory_high" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alert if check_duplicate memory usage exceeds 500 MB in a 5-minute window."
      + alarm_name                            = "cyberutopia-check_duplicate-memory-high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "FunctionName" = "check_duplicate"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "max_memory_used"
      + namespace                             = "LambdaInsights"
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "cyberutopia"
        }
      + threshold                             = 500
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.dlq_alarm will be created
+ resource "aws_cloudwatch_metric_alarm" "dlq_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Triggers if there are any messages in the DLQ."
      + alarm_name                            = "cyberutopia-dlq-alarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "QueueName" = "cyberutopia-lambda-dlq"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateNumberOfMessagesVisible"
      + namespace                             = "AWS/SQS"
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "cyberutopia"
        }
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.fetch_data_duration_high will be created
+ resource "aws_cloudwatch_metric_alarm" "fetch_data_duration_high" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alert if fetch_data function average duration exceeds 4s in a 5-minute window."
      + alarm_name                            = "cyberutopia-fetch_data-duration-high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "FunctionName" = "fetch_data"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Duration"
      + namespace                             = "AWS/Lambda"
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "cyberutopia"
        }
      + threshold                             = 4000
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.fetch_data_errors will be created
+ resource "aws_cloudwatch_metric_alarm" "fetch_data_errors" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alert if fetch_data function returns any errors in a 5-minute window."
      + alarm_name                            = "cyberutopia-fetch-data-errors"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "FunctionName" = "fetch_data"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Errors"
      + namespace                             = "AWS/Lambda"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "cyberutopia"
        }
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.fetch_data_invocations_anomaly will be created
+ resource "aws_cloudwatch_metric_alarm" "fetch_data_invocations_anomaly" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alert if fetch_data invocations deviate from normal"
      + alarm_name                            = "cyberutopia-fetch-data-invocations-anomaly"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanUpperThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "cyberutopia"
        }
      + threshold_metric_id                   = "e1"
      + treat_missing_data                    = "missing"

      + metric_query {
          + id          = "m1"
          + label       = "FetchDataInvocationsWithAnomalyDetection"
          + return_data = true
            # (2 unchanged attributes hidden)

          + metric {
              + dimensions  = {
                  + "FunctionName" = "fetch_data"
                }
              + metric_name = "Invocations"
              + namespace   = "AWS/Lambda"
              + period      = 300
              + stat        = "Sum"
                # (1 unchanged attribute hidden)
            }
        }
      + metric_query {
          + expression  = "ANOMALY_DETECTION_BAND(m1, 2)"
          + id          = "e1"
          + label       = "AnomalyDetectionBand"
          + return_data = true
            # (1 unchanged attribute hidden)
        }
    }

  # aws_cloudwatch_metric_alarm.fetch_data_memory_high will be created
+ resource "aws_cloudwatch_metric_alarm" "fetch_data_memory_high" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alert if fetch_data memory usage exceeds 900 MB in a 5-minute window."
      + alarm_name                            = "cyberutopia-fetch_data-memory-high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "FunctionName" = "fetch_data"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "max_memory_used"
      + namespace                             = "LambdaInsights"
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "cyberutopia"
        }
      + threshold                             = 900
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.notify_post_duration_high will be created
+ resource "aws_cloudwatch_metric_alarm" "notify_post_duration_high" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alert if notify_post function average duration exceeds 1m in a 5-minute window."
      + alarm_name                            = "cyberutopia-notify_post-duration-high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "FunctionName" = "notify_post"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Duration"
      + namespace                             = "AWS/Lambda"
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "cyberutopia"
        }
      + threshold                             = 60000
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.notify_post_errors will be created
+ resource "aws_cloudwatch_metric_alarm" "notify_post_errors" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alert if notify_post function returns any errors in a 5-minute window."
      + alarm_name                            = "cyberutopia-notify_post-errors"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "FunctionName" = "notify_post"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Errors"
      + namespace                             = "AWS/Lambda"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "cyberutopia"
        }
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.notify_post_invocations_anomaly will be created
+ resource "aws_cloudwatch_metric_alarm" "notify_post_invocations_anomaly" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alert if notify_post invocations deviate from normal"
      + alarm_name                            = "cyberutopia-notify-post-invocations-anomaly"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanUpperThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "cyberutopia"
        }
      + threshold_metric_id                   = "e1"
      + treat_missing_data                    = "missing"

      + metric_query {
          + id          = "m1"
          + label       = "NotifyPostInvocationsWithAnomalyDetection"
          + return_data = true
            # (2 unchanged attributes hidden)

          + metric {
              + dimensions  = {
                  + "FunctionName" = "notify_post"
                }
              + metric_name = "Invocations"
              + namespace   = "AWS/Lambda"
              + period      = 300
              + stat        = "Sum"
                # (1 unchanged attribute hidden)
            }
        }
      + metric_query {
          + expression  = "ANOMALY_DETECTION_BAND(m1, 2)"
          + id          = "e1"
          + label       = "AnomalyDetectionBand"
          + return_data = true
            # (1 unchanged attribute hidden)
        }
    }

  # aws_cloudwatch_metric_alarm.notify_post_memory_high will be created
+ resource "aws_cloudwatch_metric_alarm" "notify_post_memory_high" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alert if notify_post memory usage exceeds 300 MB in a 5-minute window."
      + alarm_name                            = "cyberutopia-notify_post-memory-high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "FunctionName" = "notify_post"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "max_memory_used"
      + namespace                             = "LambdaInsights"
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "cyberutopia"
        }
      + threshold                             = 300
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.sns_to_teams_invocations_anomaly will be created
+ resource "aws_cloudwatch_metric_alarm" "sns_to_teams_invocations_anomaly" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alert if sns_to_teams invocations deviate from normal"
      + alarm_name                            = "cyberutopia-sns-to-teams-invocations-anomaly"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanUpperThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "cyberutopia"
        }
      + threshold_metric_id                   = "e1"
      + treat_missing_data                    = "missing"

      + metric_query {
          + id          = "m1"
          + label       = "SnsToTeamsInvocationsWithAnomalyDetection"
          + return_data = true
            # (2 unchanged attributes hidden)

          + metric {
              + dimensions  = {
                  + "FunctionName" = "sns_to_teams"
                }
              + metric_name = "Invocations"
              + namespace   = "AWS/Lambda"
              + period      = 300
              + stat        = "Sum"
                # (1 unchanged attribute hidden)
            }
        }
      + metric_query {
          + expression  = "ANOMALY_DETECTION_BAND(m1, 2)"
          + id          = "e1"
          + label       = "AnomalyDetectionBand"
          + return_data = true
            # (1 unchanged attribute hidden)
        }
    }

  # aws_iam_policy.eventbridge_policy will be created
+ resource "aws_iam_policy" "eventbridge_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for CloudWatch Event to start Step Functions executions"
      + id               = (known after apply)
      + name             = "cyberutopia_eventbridge_step_functions_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "cyberutopia"
        }
    }

  # aws_iam_policy.s3_full_policy will be created
+ resource "aws_iam_policy" "s3_full_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy to allow Lambda full access to S3"
      + id               = (known after apply)
      + name             = "cyberutopia_s3_full_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:*"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::prod-cyberutopia-media-bucket",
                          + "arn:aws:s3:::prod-cyberutopia-media-bucket/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "cyberutopia"
        }
    }

  # aws_iam_role.crossaccount_s3_read_role will be created
+ resource "aws_iam_role" "crossaccount_s3_read_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::825765422855:root"
                        }
                      + Sid       = "AllowSharedServicesAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "CrossAccountS3ReadRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "cyberutopia"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.eventbridge_role will be created
+ resource "aws_iam_role" "eventbridge_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "events.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cyberutopia_eventbridge_step_functions_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "cyberutopia"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.lambda_role will be created
+ resource "aws_iam_role" "lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cyberutopia_lambda_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "cyberutopia"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.step_functions_role will be created
+ resource "aws_iam_role" "step_functions_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cyberutopia_step_functions_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "cyberutopia"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy.crossaccount_s3_read_policy will be created
+ resource "aws_iam_role_policy" "crossaccount_s3_read_policy" {
      + id          = (known after apply)
      + name        = "ReadLogo"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:*"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::prod-cyberutopia-artifacts-bucket/*"
                      + Sid      = "AllowGetLogo"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.lambda_sqs_send_message will be created
+ resource "aws_iam_role_policy" "lambda_sqs_send_message" {
      + id          = (known after apply)
      + name        = "cyberutopia_lambda_sqs_send_message"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_iam_role_policy.step_functions_policy will be created
+ resource "aws_iam_role_policy" "step_functions_policy" {
      + id          = (known after apply)
      + name        = "cyberutopia_step_functions_policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_iam_role_policy.step_functions_xray will be created
+ resource "aws_iam_role_policy" "step_functions_xray" {
      + id          = (known after apply)
      + name        = "step-functions-xray-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowXRayWrites"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy_attachment.attach_eventbridge_policy will be created
+ resource "aws_iam_role_policy_attachment" "attach_eventbridge_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "cyberutopia_eventbridge_step_functions_role"
    }

  # aws_iam_role_policy_attachment.lambda_basic_execution will be created
+ resource "aws_iam_role_policy_attachment" "lambda_basic_execution" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "cyberutopia_lambda_role"
    }

  # aws_iam_role_policy_attachment.lambda_insights_policy will be created
+ resource "aws_iam_role_policy_attachment" "lambda_insights_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/CloudWatchLambdaInsightsExecutionRolePolicy"
      + role       = "cyberutopia_lambda_role"
    }

  # aws_iam_role_policy_attachment.lambda_s3_full_access will be created
+ resource "aws_iam_role_policy_attachment" "lambda_s3_full_access" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "cyberutopia_lambda_role"
    }

  # aws_iam_role_policy_attachment.lambda_sqs_send_message will be created
+ resource "aws_iam_role_policy_attachment" "lambda_sqs_send_message" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaSQSQueueExecutionRole"
      + role       = "cyberutopia_lambda_role"
    }

  # aws_iam_role_policy_attachment.lambda_xray_write_access will be created
+ resource "aws_iam_role_policy_attachment" "lambda_xray_write_access" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSXRayDaemonWriteAccess"
      + role       = "cyberutopia_lambda_role"
    }

  # aws_lambda_function.check_duplicate will be created
+ resource "aws_lambda_function" "check_duplicate" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./artifacts/scripts/check_duplicate/check_duplicate.zip"
      + function_name                  = "check_duplicate"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-east-2:580247275435:layer:LambdaInsightsExtension:14",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "GapI9OTKd6+g+95Q9ZTzcKIpi1ia1WEXM+yLDiqHG7Y="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "cyberutopia"
        }
      + timeout                        = 5
      + version                        = (known after apply)

      + dead_letter_config {
          + target_arn = (known after apply)
        }

      + environment {
          + variables = {
              + "IDEMPOTENCY_BUCKET" = "prod-cyberutopia-media-bucket"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config {
          + mode = "Active"
        }
    }

  # aws_lambda_function.fetch_data will be created
+ resource "aws_lambda_function" "fetch_data" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./artifacts/scripts/fetch_data/fetch_data.zip"
      + function_name                  = "fetch_data"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-east-2:580247275435:layer:LambdaInsightsExtension:14",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "sjA7YxXVH/6TmtA4t8Qe/BBmqk5d3T5BjwDBkg9kAls="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "cyberutopia"
        }
      + timeout                        = 5
      + version                        = (known after apply)

      + dead_letter_config {
          + target_arn = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config {
          + mode = "Active"
        }
    }

  # aws_lambda_function.notify_post will be created
+ resource "aws_lambda_function" "notify_post" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./artifacts/scripts/notify_post/notify_post.zip"
      + function_name                  = "notify_post"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-east-2:825765422855:layer:Python_Requests:1",
          + "arn:aws:lambda:us-east-2:580247275435:layer:LambdaInsightsExtension:14",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "H31+0XWUY4WwaTR1G7KR3INazRgKXCm+lH80dDODI6Y="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "cyberutopia"
        }
      + timeout                        = 5
      + version                        = (known after apply)

      + dead_letter_config {
          + target_arn = (known after apply)
        }

      + environment {
          + variables = {
              + "TARGET_BUCKET"     = "prod-cyberutopia-media-bucket"
              + "TEAMS_WEBHOOK_URL" = "https://feedutopia.webhook.office.com/webhookb2/966e2862-f48e-48fe-86af-fd6ad4a54c2d@c76f234b-5cdf-49b5-b968-9d0517a5c694/IncomingWebhook/34cfa5f57d204e2e8a44f35ff760f1c0/2742a55c-9d93-47f0-aed1-1965283926c0/V2rrJqAS4boXyOZgERDOLyoHGgUCpZPZEx3gBAB_eAqjI1"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config {
          + mode = "Active"
        }
    }

  # aws_lambda_function.sns_to_teams will be created
+ resource "aws_lambda_function" "sns_to_teams" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./artifacts/scripts/sns_to_teams/sns_to_teams.zip"
      + function_name                  = "sns_to_teams"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "oSUV8cM7HGcNv8z1DbEVVIu2iOFSAFgRogGYwFQEOJI="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "cyberutopia"
        }
      + timeout                        = 5
      + version                        = (known after apply)

      + dead_letter_config {
          + target_arn = (known after apply)
        }

      + environment {
          + variables = {
              + "TEAMS_WEBHOOK_URL" = "https://feedutopia.webhook.office.com/webhookb2/15bab4d6-66e1-4121-8e53-f72e565043db@c76f234b-5cdf-49b5-b968-9d0517a5c694/IncomingWebhook/74d88730408141d995e6d3332f350d9c/2742a55c-9d93-47f0-aed1-1965283926c0/V2HdJ-E9GgUG_Vndpd0UX6B240fszGkuj9F-du8xCTvvA1"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config {
          + mode = "Active"
        }
    }

  # aws_lambda_permission.allow_sns_invoke will be created
+ resource "aws_lambda_permission" "allow_sns_invoke" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sns_to_teams"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromSNS"
      + statement_id_prefix = (known after apply)
    }

  # aws_s3_bucket.media_bucket will be created
+ resource "aws_s3_bucket" "media_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "prod-cyberutopia-media-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "cyberutopia"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_lifecycle_configuration.media_bucket_lifecycle will be created
+ resource "aws_s3_bucket_lifecycle_configuration" "media_bucket_lifecycle" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "delete_posts_after_1_week"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + expiration {
              + days                         = 7
              + expired_object_delete_marker = false
            }

          + filter {
              + prefix = "posts/"
            }
        }
    }

  # aws_s3_bucket_server_side_encryption_configuration.media_bucket_encryption will be created
+ resource "aws_s3_bucket_server_side_encryption_configuration" "media_bucket_encryption" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + bucket_key_enabled = true

          + apply_server_side_encryption_by_default {
              + kms_master_key_id = "alias/aws/s3"
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # aws_s3_bucket_versioning.media_bucket_versioning will be created
+ resource "aws_s3_bucket_versioning" "media_bucket_versioning" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # aws_sfn_state_machine.automated_workflow will be created
+ resource "aws_sfn_state_machine" "automated_workflow" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = (known after apply)
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "automated_cyberutopia_workflow"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = (known after apply)
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags_all                  = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "cyberutopia"
        }
      + type                      = "EXPRESS"
      + version_description       = (known after apply)

      + encryption_configuration (known after apply)

      + logging_configuration {
          + include_execution_data = true
          + level                  = "ALL"
          + log_destination        = (known after apply)
        }

      + tracing_configuration {
          + enabled = true
        }
    }

  # aws_sns_topic.monitoring_topic will be created
+ resource "aws_sns_topic" "monitoring_topic" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "cyberutopia-monitoring-topic"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "cyberutopia"
        }
      + tracing_config              = (known after apply)
    }

  # aws_sns_topic_subscription.sns_lambda_subscription will be created
+ resource "aws_sns_topic_subscription" "sns_lambda_subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # aws_sqs_queue.lambda_dlq will be created
+ resource "aws_sqs_queue" "lambda_dlq" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "cyberutopia-lambda-dlq"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags_all                          = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "cyberutopia"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # aws_sqs_queue_policy.lambda_dlq_policy will be created
+ resource "aws_sqs_queue_policy" "lambda_dlq_policy" {
      + id        = (known after apply)
      + policy    = (known after apply)
      + queue_url = (known after apply)
    }

  # aws_xray_group.production_group will be created
+ resource "aws_xray_group" "production_group" {
      + arn               = (known after apply)
      + filter_expression = "annotation.stage = \"prod\""
      + group_name        = "ProductionTraces"
      + id                = (known after apply)
      + tags_all          = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "cyberutopia"
        }

      + insights_configuration (known after apply)
    }

  # aws_xray_sampling_rule.critical_service_rule will be created
+ resource "aws_xray_sampling_rule" "critical_service_rule" {
      + arn            = (known after apply)
      + fixed_rate     = 1
      + host           = "*"
      + http_method    = "*"
      + id             = (known after apply)
      + priority       = 10
      + reservoir_size = 2
      + resource_arn   = "*"
      + rule_name      = "CriticalService"
      + service_name   = "critical"
      + service_type   = "*"
      + tags_all       = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "cyberutopia"
        }
      + url_path       = "*"
      + version        = 1
    }

  # aws_xray_sampling_rule.fallback_rule will be created
+ resource "aws_xray_sampling_rule" "fallback_rule" {
      + arn            = (known after apply)
      + fixed_rate     = 0.05
      + host           = "*"
      + http_method    = "*"
      + id             = (known after apply)
      + priority       = 9999
      + reservoir_size = 1
      + resource_arn   = "*"
      + rule_name      = "Fallback"
      + service_name   = "*"
      + service_type   = "*"
      + tags_all       = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "cyberutopia"
        }
      + url_path       = "*"
      + version        = 1
    }

Plan: 58 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p cyberutopia-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.feedutopia.com:4141/lock?id=ryan-longoria%252FFeedUtopia%252Faccounts%252Fcyberutopia-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p cyberutopia-prod
  ```
Plan: 58 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```